In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [44]:
lst = ["Yasser","Khaled","Saleh"] 
s = pd.Series(lst , index=[1, 2, 3])
s

1    Yasser
2    Khaled
3     Saleh
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [45]:

s.index=[11,12,13]
s

11    Yasser
12    Khaled
13     Saleh
dtype: object

## Q3: Retrieve First and second elements.

In [46]:
s[:2]

11    Yasser
12    Khaled
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [47]:
s1 = pd.Series({13: 'Saleh', 14:'Saleh'})
s = pd.concat((s, s1))
s.index.drop_duplicates()

Index([11, 12, 13, 14], dtype='int64')

In [48]:
 s.drop_duplicates()

11    Yasser
12    Khaled
13     Saleh
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [51]:
students = {
    'ID': [1],
    'Name': ["Yasser"],
     'GPA': [4.32]
}
stdDf = pd.DataFrame(students)
stdDf

   ID    Name   GPA
0   1  Yasser  4.32

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [52]:
df = pd.read_csv("educ_figdp_1_Data.csv")
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [68]:
df.loc[0:5, ['TIME', 'Value']]

   TIME Value
0  2000     :
1  2001     :
2  2002  5.00
3  2003  5.03
4  2004  4.95
5  2005  4.92

In [69]:
df[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e